tests/stress/load-test.yml
config:
  target: "http://localhost:4173"
  phases:
    - duration: 20
      arrivalRate: 5
      name: "Warm up phase"
    - duration: 30
      arrivalRate: 20
      name: "Sustained load phase"
    - duration: 10
      arrivalRate: 50
      name: "Stress spike phase"
scenarios:
  - name: "Homepage loading"
    flow:
      - get:
          url: "/"
      - think: 1
      - get:
          url: "/index.html"